# Homework Solutions

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [3]:
engine.connect()

# Load data into postgres

In [5]:
green = pd.read_csv("green_tripdata_2019-01.csv.gz")

In [6]:
green.head(2)

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2018-12-21 15:17:29,2018-12-21 15:18:57,N,1,264,264,5,0.00,3.0,0.5,0.5,0.0,0.0,NaN,0.3,4.3,2,1,NaN
1,2,2019-01-01 00:10:16,2019-01-01 00:16:32,N,1,97,49,2,0.86,6.0,0.5,0.5,0.0,0.0,NaN,0.3,7.3,2,1,NaN

In [7]:
green.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 630918 entries, 0 to 630917
Data columns (total 20 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   VendorID               630918 non-null  int64
 1   lpep_pickup_datetime   630918 non-null  object
 2   lpep_dropoff_datetime  630918 non-null  object
 3   store_and_fwd_flag     630918 non-null  object
 4   RatecodeID             630918 non-null  int64
 5   PULocationID           630918 non-null  int64
 6   DOLocationID           630918 non-null  int64
 7   passenger_count        630918 non-null  int64
 8   trip_distance          630918 non-null  float64
 9   fare_amount            630918 non-null  float64
 10  extra                  630918 non-null  float64
 11  mta_tax                630918 non-null  float64
 12  tip_amount             630918 non-null  float64
 13  tolls_amount           630918 non-null  float64
 14  ehail_fee              0 non-null       float64
 15  improvement_surcharge  630918 non-null  float64
 16  total_amount           630918 non-null  float64
 17  payment_type           630918 non-null  int64
 18  trip_type              630918 non-null  int64
 19  congestion_surcharge   84538 non-null   float64
dtypes: float64(10), int64(7), object(3)
memory usage: 96.3+ MB

In [8]:
#convert to datetime
green.lpep_pickup_datetime = pd.to_datetime(green.lpep_pickup_datetime)
green.lpep_dropoff_datetime = pd.to_datetime(green.lpep_dropoff_datetime)

In [9]:
#load into postgres
green.to_sql(name='green_tripdata_trip',con=engine,index=False,if_exists='replace')

In [10]:
#load taxidata
taxizone_lookup = pd.read_csv("taxi+_zone_lookup.csv")

In [11]:
taxizone_lookup.to_sql(name="taxizone_lookup",con=engine,if_exists='replace')

In [12]:
#test db
query = """
SELECT * FROM green_tripdata_trip LIMIT 5
"""
pd.read_sql(query,con=engine)

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2018-12-21 15:17:29,2018-12-21 15:18:57,N,1,264,264,5,0.00,3.0,0.5,0.5,0.00,0.0,None,0.3,4.30,2,1,None
1,2,2019-01-01 00:10:16,2019-01-01 00:16:32,N,1,97,49,2,0.86,6.0,0.5,0.5,0.00,0.0,None,0.3,7.30,2,1,None
2,2,2019-01-01 00:27:11,2019-01-01 00:31:38,N,1,49,189,2,0.66,4.5,0.5,0.5,0.00,0.0,None,0.3,5.80,1,1,None
3,2,2019-01-01 00:46:20,2019-01-01 01:04:54,N,1,189,17,2,2.68,13.5,0.5,0.5,2.96,0.0,None,0.3,19.71,1,1,None
4,2,2019-01-01 00:19:06,2019-01-01 00:39:43,N,1,82,258,1,4.53,18.0,0.5,0.5,0.00,0.0,None,0.3,19.30,2,1,None

In [13]:
query = """
SELECT * FROM taxizone_lookup
"""
pd.read_sql(query,con=engine)

     index  LocationID        Borough                     Zone service_zone
0        0           1            EWR           Newark Airport          EWR
1        1           2         Queens              Jamaica Bay    Boro Zone
2        2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3        3           4      Manhattan            Alphabet City  Yellow Zone
4        4           5  Staten Island            Arden Heights    Boro Zone
..     ...         ...            ...                      ...          ...
260    260         261      Manhattan       World Trade Center  Yellow Zone
261    261         262      Manhattan           Yorkville East  Yellow Zone
262    262         263      Manhattan           Yorkville West  Yellow Zone
263    263         264        Unknown                       NV         None
264    264         265        Unknown                     None         None

[265 rows x 5 columns]

#How many taxi trips were totally made on January 15?

Tip: started and finished on 2019-01-15.

In [14]:
query = """
SELECT COUNT(*)
FROM green_tripdata_trip
WHERE CAST(lpep_pickup_datetime AS DATE) = '2019-01-15' 
AND CAST(lpep_dropoff_datetime AS DATE) = '2019-01-15';
"""

pd.read_sql(query,con=engine)

   count
0  20530

In [15]:
#Which was the day with the largest trip distance?
query = """
SELECT MAX(trip_distance),CAST(lpep_pickup_datetime AS DATE)
FROM green_tripdata_trip
GROUP BY 2
ORDER BY 1 DESC
LIMIT 2;
"""

pd.read_sql(query,con=engine)

      max lpep_pickup_datetime
0  117.99           2019-01-15
1   80.96           2019-01-18

In [17]:
#In 2019-01-01 how many trips had 2 and 3 passengers
query = """
SELECT COUNT(*),CAST(lpep_pickup_datetime AS DATE)
FROM green_tripdata_trip
WHERE passenger_count = 2
GROUP BY CAST(lpep_pickup_datetime AS DATE)
HAVING CAST(lpep_pickup_datetime AS DATE) = '2019-01-01' ;
"""

pd.read_sql(query,con=engine)

   count lpep_pickup_datetime
0   1282           2019-01-01

In [18]:
#In 2019-01-01 how many trips had 2 and 3 passengers
query = """
SELECT COUNT(*),CAST(lpep_pickup_datetime AS DATE)
FROM green_tripdata_trip
WHERE passenger_count = 3
GROUP BY CAST(lpep_pickup_datetime AS DATE)
HAVING CAST(lpep_pickup_datetime AS DATE) = '2019-01-01' ;
"""

pd.read_sql(query,con=engine)

   count lpep_pickup_datetime
0    254           2019-01-01

In [53]:
#For the passengers picked up in the Astoria Zone which was the drop off zone that had the largest tip? 
#We want the name of the zone, not the id.
query = """
SELECT MAX(g.tip_amount),t."Zone",t."LocationID",g."DOLocationID"
FROM green_tripdata_trip g
JOIN taxizone_lookup t 
ON g."PULocationID" = t."LocationID"
WHERE t."LocationID"  = (SELECT t."Zone" FROM taxizone_lookup t WHERE t."LocationID" = () )
GROUP BY 2,3,4
HAVING t."Zone" = 'Astoria'
ORDER BY 1 DESC
LIMIT 1;
"""

pd.read_sql(query,con=engine)

    max     Zone  LocationID  DOLocationID
0  88.0  Astoria           7           146

In [ ]:
#PU = Astoria

In [56]:
#For the passengers picked up in the Astoria Zone which was the drop off zone that had the largest tip? 
#We want the name of the zone, not the id.
query = """
SELECT t."Zone" 
FROM taxizone_lookup t 
WHERE t."LocationID" = ( 
SELECT g."DOLocationID"
FROM green_tripdata_trip g
JOIN taxizone_lookup t 
ON g."PULocationID" = t."LocationID"
GROUP BY t."Zone",t."LocationID",g."DOLocationID"
HAVING t."Zone" = 'Astoria'
ORDER BY MAX(g.tip_amount) DESC
LIMIT 1) 
"""
pd.read_sql(query,con=engine)

                            Zone
0  Long Island City/Queens Plaza